/*
 * Даны два угла треугольника (в градусах). Определить, существует ли такой треугольник, и если да, то будет ли 
 * он прямоугольным.
 */

import java.util.Scanner;

public class T1 {

	public static void main(String[] args) {
		int angleA, angleB;
		Scanner input = new Scanner(System.in);
		
		// запрашиваем у пользователя ввод начения угла А
		System.out.print("Введите значение угла 'A': ");
		angleA = input.nextInt();
		
		// запрашиваем у пользователя ввод значения угла В
		System.out.print("Введите значение угла 'B': ");
		angleB = input.nextInt();
		
				
	}

}
