/*
 * Даны три точки А(х1,у1), В(х2,у2) и С(х3,у3). Определить, будут ли они расположены на одной прямой
 */

public class T3 {

	public static void main(String[] args) {
		int x1 = 8, y1 = -1;
		int x2 = -3, y2 = -3;
		int x3 = 13, y3 = 0;
		int max;
		boolean res = false;
		
		// 1. Точки будут на одной прямой, если совпадают все координаты по х или по у
		if ( ( (x1 == x2) && (x1 == x3) ) || ( (y1 == y2) && (y1 == y3) ) ) {
			res = true;
		} else {
			
			// 2. Точки будут на одной прямой, если они лежат на гипотенузе прямоугольного треутольника
			
			// упорядочим точки на координатной плоскости в направлении по оси Х слева направо
			if (x1 > x2) { max = x1; x1 = x2; x2 = max;	max = y1; y1 = y2; y2 = max;}			
			if (x1 > x3) { max = x1; x1 = x3; x3 = max;	max = y1; y1 = y3; y3 = max;}			
			if (x2 > x3) { max = x2; x2 = x3; x3 = max; max = y2; y2 = y3; y3 = max;}			
						
			System.out.println("x = " + x1 + ", " + x2 + ", " + x3);
			System.out.println("y = " + y1 + ", " + y2 + ", " + y3);
		}		
		
		if (res) {
			System.out.print("Точки расположены на одной прямой");
		} else {
			System.out.print("Точки не расположены на одной прямой");
		}
	}

}
